app/controllers/login_controller.rb

  def login
    @username = params[:username]
    @password = params[:password]
    @user = User.where(:username => @username).first
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'gmoeck' LIMIT 1